<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 个性化应用设置
    // +----------------------------------------------------------------------
//   定义资源目录
    "__ASSETS__" => "/fcg/public/static",
//    定义路由模式
    'URL_MODEL'=>2,


    'session' => [
        'auto_start' => true,
        'name' => 'login@',
        'expire' => 1800,                        /*时间长度*/
    ],

    'captcha'  => [
        // 验证码字符集合
        'codeSet'  => 'XQWERTYUPASFHJKZVNM2345679',
        // 验证码字体大小(px)
        'fontSize' => 32,
        // 是否画混淆曲线
        'useCurve' => false,
        // 验证码位数
        'length'   => 4,
        // 验证成功后是否重置
        'reset'    => true
    ],

    'http_exception_template'    =>  [
        // 定义404错误的重定向页面地址
        404 =>  APP_PATH.'404.html',
        // 还可以定义其它的HTTP status
        500 =>  APP_PATH.'500.html',
    ],



];
